"""
Модуль 2 Python Advanced, Урок №7. Рекурсія та метакласи, Вправа 1

Задача 1: Сума цифр числа

Напишіть рекурсивну функцію, яка обчислює суму цифр заданого числа.
(приклад виводу у теорії)

Задача 1. Сума цифр числа
Опис завдання: Напишіть рекурсивну функцію, яка обчислює суму цифр заданого
числа.
Приклад виводу:
print(sum_digits(1234)) # 10
"""


def sum_digits(n: int):
    """
    рекурсивна функцію, яка обчислює суму цифр заданого числа.
    :param n:
    :return: int
    """

    if (len(str(n)) == 1):
        return int(str(n)[0])
    else:
        s = int(str(n)[len(str(n))-1]) + sum_digits(int(str(n)[:len(str(n))-1]))
        return s


print(sum_digits(1234))
